Tekla Open API Reference for Tekla Structures 2025
LineTypes Methods
The LineTypes type exposes the following members.
Methods
Name | Description
Clone
 Creates a new object that is a copy of the current instance.
Custom
 The Custom line type defines a line that is drawn using one of the custom line types, as specified by the CustomLineTypeName.
Equals
 Returns true if the current object and the given object are equal.
 (Overrides Object.Equals(Object).)
GetHashCode
 Returns a hash code for the object.
 (Overrides Object.GetHashCode().)
IsEqual
 Compares the current object with an object of the same type.
ToString
 Returns the LineTypes information as a string.
 (Overrides Object.ToString().)
Top
See Also
Reference
LineTypes Class
Tekla.Structures.Drawing Namespace